//"Временная" сложность алгоритма описывается тремя характеристиками:
// О - "о" большое - верхняя граница вычислительной сложности.
// Ω - омега - нижняя граница вычислительной сложности.
// Θ - тэта - точная граница сложности.

// Нет взаимосвязи между худшим/лучшим/ожидаемым случаями и
// границами сложности алгоритма.

// Синтаксис "о" большое описывает скорость роста -> 
// исключай константы;
// исключай второстепенные факторы.

// Амортизированное время позволяет указать, что худший случай
// происходит время от времени, а повторение данного случая
// также теребует много времени, поэтому лишние затраты амортизируются.

//Посмотреть пример с динамически расширяемым массивом...